facchinm/ArduinoCore-nRF528x-mbedos/boards.txt
##############################################################




##############################################################

unisense.name=Unisense
unisense.build.core=arduino
unisense.build.crossprefix=arm-none-eabi-
unisense.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

unisense.build.variant=RBLAB_BLENANO2
unisense.build.mcu=cortex-m4
unisense.build.extra_flags=
unisense.build.architecture=cortex-m4
unisense.build.fpu=fpv4-sp-d16
unisense.build.float-abi=softfp
unisense.build.board=RBLAB_BLENANO2
unisense.build.ldscript=linker_script.ld
unisense.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52832 -DARDUINO_ARCH_MBED
unisense.compiler.mbed.defines={build.variant.path}/defines.txt
unisense.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
unisense.compiler.mbed.cflags={build.variant.path}/cflags.txt
unisense.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
unisense.compiler.mbed.includes={build.variant.path}/includes.txt
unisense.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
unisense.compiler.mbed="{build.variant.path}/libs/libmbed.a"

unisense.upload.tool=openocd
unisense.upload.protocol=
unisense.upload.config=-f target/nrf52.cfg
unisense.upload.programmer=-f interface/cmsis-dap.cfg
unisense.upload.use_1200bps_touch=false
unisense.upload.wait_for_upload_port=true
unisense.upload.native_usb=true
unisense.upload.maximum_size=527616
unisense.upload.maximum_data_size=64288

unisense.bootloader.tool=openocd
unisense.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
unisense.bootloader.config=-f target/nrf52.cfg
unisense.bootloader.programmer=-f interface/cmsis-dap.cfg
unisense.bootloader.file=nano33ble/bootloader.hex

##############################################################

nano33ble.name=Arduino Nano 33 BLE
nano33ble.build.core=arduino
nano33ble.build.crossprefix=arm-none-eabi-
nano33ble.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

nano33ble.build.variant=ARDUINO_NANO33BLE
nano33ble.build.mcu=cortex-m4
nano33ble.build.extra_flags=
nano33ble.build.architecture=cortex-m4
nano33ble.build.fpu=fpv4-sp-d16
nano33ble.build.float-abi=softfp
nano33ble.build.board=ARDUINO_NANO33BLE
nano33ble.build.ldscript=linker_script.ld
nano33ble.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
nano33ble.compiler.mbed.defines={build.variant.path}/defines.txt
nano33ble.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nano33ble.compiler.mbed.cflags={build.variant.path}/cflags.txt
nano33ble.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nano33ble.compiler.mbed.includes={build.variant.path}/includes.txt
nano33ble.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nano33ble.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
nano33ble.vid.0=0x2341
nano33ble.pid.0=0x005a
nano33ble.vid.1=0x2341
nano33ble.pid.1=0x805a

nano33ble.upload.tool=bossac
nano33ble.upload.protocol=
nano33ble.upload.use_1200bps_touch=true
nano33ble.upload.wait_for_upload_port=true
nano33ble.upload.native_usb=true
nano33ble.upload.maximum_size=983040
nano33ble.upload.maximum_data_size=262144

nano33ble.bootloader.tool=openocd
nano33ble.bootloader.extra_action.preflash=nrf5 mass_erase
nano33ble.bootloader.config=-f target/nrf52.cfg
nano33ble.bootloader.programmer=-f interface/cmsis-dap.cfg
nano33ble.bootloader.file=nano33ble/bootloader.hex